app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "daffy"], ["body", "Quack quack\r\n"], ["article_id", 5], ["created_at", "2016-04-11 20:07:29.888090"], ["updated_at", "2016-04-11 20:07:29.888090"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.article_id = params[:article_id]

    @comment.save